MikroElektronika/core_packages/PIC/XC8/def/PIC18F43K22/mcu.h
// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xF3F);
#ifndef _LIB_BUILD
asm("PMD0 equ 0F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0xF3F);
// bitfield macros
#define _PMD0_TMR1MD_POSN                                   0x0
#define _PMD0_TMR1MD_POSITION                               0x0
#define _PMD0_TMR1MD_SIZE                                   0x1
#define _PMD0_TMR1MD_LENGTH                                 0x1
#define _PMD0_TMR1MD_MASK                                   0x1
#define _PMD0_TMR2MD_POSN                                   0x1
#define _PMD0_TMR2MD_POSITION                               0x1
#define _PMD0_TMR2MD_SIZE                                   0x1
#define _PMD0_TMR2MD_LENGTH                                 0x1
#define _PMD0_TMR2MD_MASK                                   0x2
#define _PMD0_TMR3MD_POSN                                   0x2
#define _PMD0_TMR3MD_POSITION                               0x2
#define _PMD0_TMR3MD_SIZE                                   0x1
#define _PMD0_TMR3MD_LENGTH                                 0x1
#define _PMD0_TMR3MD_MASK                                   0x4
#define _PMD0_TMR4MD_POSN                                   0x3
#define _PMD0_TMR4MD_POSITION                               0x3
#define _PMD0_TMR4MD_SIZE                                   0x1
#define _PMD0_TMR4MD_LENGTH                                 0x1
#define _PMD0_TMR4MD_MASK                                   0x8
#define _PMD0_TMR5MD_POSN                                   0x4
#define _PMD0_TMR5MD_POSITION                               0x4
#define _PMD0_TMR5MD_SIZE                                   0x1
#define _PMD0_TMR5MD_LENGTH                                 0x1
#define _PMD0_TMR5MD_MASK                                   0x10
#define _PMD0_TMR6MD_POSN                                   0x5
#define _PMD0_TMR6MD_POSITION                               0x5
#define _PMD0_TMR6MD_SIZE                                   0x1
#define _PMD0_TMR6MD_LENGTH                                 0x1
#define _PMD0_TMR6MD_MASK                                   0x20
#define _PMD0_UART1MD_POSN                                  0x6
#define _PMD0_UART1MD_POSITION                              0x6
#define _PMD0_UART1MD_SIZE                                  0x1
#define _PMD0_UART1MD_LENGTH                                0x1
#define _PMD0_UART1MD_MASK                                  0x40
#define _PMD0_UART2MD_POSN                                  0x7
#define _PMD0_UART2MD_POSITION                              0x7
#define _PMD0_UART2MD_SIZE                                  0x1
#define _PMD0_UART2MD_LENGTH                                0x1
#define _PMD0_UART2MD_MASK                                  0x80
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

// Register: VREFCON2
#define VREFCON2 VREFCON2
extern volatile unsigned char           VREFCON2            __at(0xF40);
#ifndef _LIB_BUILD
asm("VREFCON2 equ 0F40h");
#endif
// aliases
extern volatile unsigned char           DACCON1             __at(0xF40);
#ifndef _LIB_BUILD
asm("DACCON1 equ 0F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
} VREFCON2bits_t;
extern volatile VREFCON2bits_t VREFCON2bits __at(0xF40);
// bitfield macros
#define _VREFCON2_DACR_POSN                                 0x0
#define _VREFCON2_DACR_POSITION                             0x0
#define _VREFCON2_DACR_SIZE                                 0x5
#define _VREFCON2_DACR_LENGTH                               0x5
#define _VREFCON2_DACR_MASK                                 0x1F
#define _VREFCON2_DACR0_POSN                                0x0
#define _VREFCON2_DACR0_POSITION                            0x0
#define _VREFCON2_DACR0_SIZE                                0x1
#define _VREFCON2_DACR0_LENGTH                              0x1
#define _VREFCON2_DACR0_MASK                                0x1
#define _VREFCON2_DACR1_POSN                                0x1
#define _VREFCON2_DACR1_POSITION                            0x1
#define _VREFCON2_DACR1_SIZE                                0x1
#define _VREFCON2_DACR1_LENGTH                              0x1
#define _VREFCON2_DACR1_MASK                                0x2
#define _VREFCON2_DACR2_POSN                                0x2
#define _VREFCON2_DACR2_POSITION                            0x2
#define _VREFCON2_DACR2_SIZE                                0x1
#define _VREFCON2_DACR2_LENGTH                              0x1
#define _VREFCON2_DACR2_MASK                                0x4
#define _VREFCON2_DACR3_POSN                                0x3
#define _VREFCON2_DACR3_POSITION                            0x3
#define _VREFCON2_DACR3_SIZE                                0x1
#define _VREFCON2_DACR3_LENGTH                              0x1
#define _VREFCON2_DACR3_MASK                                0x8
#define _VREFCON2_DACR4_POSN                                0x4
#define _VREFCON2_DACR4_POSITION                            0x4
#define _VREFCON2_DACR4_SIZE                                0x1
#define _VREFCON2_DACR4_LENGTH                              0x1
#define _VREFCON2_DACR4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
} DACCON1bits_t;
extern volatile DACCON1bits_t DACCON1bits __at(0xF40);
// bitfield macros
#define _DACCON1_DACR_POSN                                  0x0
#define _DACCON1_DACR_POSITION                              0x0
#define _DACCON1_DACR_SIZE                                  0x5
#define _DACCON1_DACR_LENGTH                                0x5
#define _DACCON1_DACR_MASK                                  0x1F
#define _DACCON1_DACR0_POSN                                 0x0
#define _DACCON1_DACR0_POSITION                             0x0
#define _DACCON1_DACR0_SIZE                                 0x1
#define _DACCON1_DACR0_LENGTH                               0x1
#define _DACCON1_DACR0_MASK                                 0x1
#define _DACCON1_DACR1_POSN                                 0x1
#define _DACCON1_DACR1_POSITION                             0x1
#define _DACCON1_DACR1_SIZE                                 0x1
#define _DACCON1_DACR1_LENGTH                               0x1
#define _DACCON1_DACR1_MASK                                 0x2
#define _DACCON1_DACR2_POSN                                 0x2
#define _DACCON1_DACR2_POSITION                             0x2
#define _DACCON1_DACR2_SIZE                                 0x1
#define _DACCON1_DACR2_LENGTH                               0x1
#define _DACCON1_DACR2_MASK                                 0x4
#define _DACCON1_DACR3_POSN                                 0x3
#define _DACCON1_DACR3_POSITION                             0x3
#define _DACCON1_DACR3_SIZE                                 0x1
#define _DACCON1_DACR3_LENGTH                               0x1
#define _DACCON1_DACR3_MASK                                 0x8
#define _DACCON1_DACR4_POSN                                 0x4
#define _DACCON1_DACR4_POSITION                             0x4
#define _DACCON1_DACR4_SIZE                                 0x1
#define _DACCON1_DACR4_LENGTH                               0x1
#define _DACCON1_DACR4_MASK                                 0x10

// Register: VREFCON1
#define VREFCON1 VREFCON1
extern volatile unsigned char           VREFCON1            __at(0xF41);
#ifndef _LIB_BUILD
asm("VREFCON1 equ 0F41h");
#endif
// aliases
extern volatile unsigned char           DACCON0             __at(0xF41);
#ifndef _LIB_BUILD
asm("DACCON0 equ 0F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACNSS                 :1;
        unsigned                        :1;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE                  :1;
        unsigned DACLPS                 :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} VREFCON1bits_t;
