MikroElektronika/core_packages/PIC/XC8/def/PIC18F43K22/mcu.h
extern volatile CM2CONbits_t CM2CONbits __at(0xF78);
// bitfield macros
#define _CM2CON_C2CH_POSN                                   0x0
#define _CM2CON_C2CH_POSITION                               0x0
#define _CM2CON_C2CH_SIZE                                   0x2
#define _CM2CON_C2CH_LENGTH                                 0x2
#define _CM2CON_C2CH_MASK                                   0x3
#define _CM2CON_C2R_POSN                                    0x2
#define _CM2CON_C2R_POSITION                                0x2
#define _CM2CON_C2R_SIZE                                    0x1
#define _CM2CON_C2R_LENGTH                                  0x1
#define _CM2CON_C2R_MASK                                    0x4
#define _CM2CON_C2SP_POSN                                   0x3
#define _CM2CON_C2SP_POSITION                               0x3
#define _CM2CON_C2SP_SIZE                                   0x1
#define _CM2CON_C2SP_LENGTH                                 0x1
#define _CM2CON_C2SP_MASK                                   0x8
#define _CM2CON_C2POL_POSN                                  0x4
#define _CM2CON_C2POL_POSITION                              0x4
#define _CM2CON_C2POL_SIZE                                  0x1
#define _CM2CON_C2POL_LENGTH                                0x1
#define _CM2CON_C2POL_MASK                                  0x10
#define _CM2CON_C2OE_POSN                                   0x5
#define _CM2CON_C2OE_POSITION                               0x5
#define _CM2CON_C2OE_SIZE                                   0x1
#define _CM2CON_C2OE_LENGTH                                 0x1
#define _CM2CON_C2OE_MASK                                   0x20
#define _CM2CON_C2OUT_POSN                                  0x6
#define _CM2CON_C2OUT_POSITION                              0x6
#define _CM2CON_C2OUT_SIZE                                  0x1
#define _CM2CON_C2OUT_LENGTH                                0x1
#define _CM2CON_C2OUT_MASK                                  0x40
#define _CM2CON_C2ON_POSN                                   0x7
#define _CM2CON_C2ON_POSITION                               0x7
#define _CM2CON_C2ON_SIZE                                   0x1
#define _CM2CON_C2ON_LENGTH                                 0x1
#define _CM2CON_C2ON_MASK                                   0x80
#define _CM2CON_C2CH0_POSN                                  0x0
#define _CM2CON_C2CH0_POSITION                              0x0
#define _CM2CON_C2CH0_SIZE                                  0x1
#define _CM2CON_C2CH0_LENGTH                                0x1
#define _CM2CON_C2CH0_MASK                                  0x1
#define _CM2CON_C2CH1_POSN                                  0x1
#define _CM2CON_C2CH1_POSITION                              0x1
#define _CM2CON_C2CH1_SIZE                                  0x1
#define _CM2CON_C2CH1_LENGTH                                0x1
#define _CM2CON_C2CH1_MASK                                  0x2
#define _CM2CON_CCH02_POSN                                  0x0
#define _CM2CON_CCH02_POSITION                              0x0
#define _CM2CON_CCH02_SIZE                                  0x1
#define _CM2CON_CCH02_LENGTH                                0x1
#define _CM2CON_CCH02_MASK                                  0x1
#define _CM2CON_CCH12_POSN                                  0x1
#define _CM2CON_CCH12_POSITION                              0x1
#define _CM2CON_CCH12_SIZE                                  0x1
#define _CM2CON_CCH12_LENGTH                                0x1
#define _CM2CON_CCH12_MASK                                  0x2
#define _CM2CON_COE2_POSN                                   0x6
#define _CM2CON_COE2_POSITION                               0x6
#define _CM2CON_COE2_SIZE                                   0x1
#define _CM2CON_COE2_LENGTH                                 0x1
#define _CM2CON_COE2_MASK                                   0x40
#define _CM2CON_CON2_POSN                                   0x7
#define _CM2CON_CON2_POSITION                               0x7
#define _CM2CON_CON2_SIZE                                   0x1
#define _CM2CON_CON2_LENGTH                                 0x1
#define _CM2CON_CON2_MASK                                   0x80
#define _CM2CON_CPOL2_POSN                                  0x5
#define _CM2CON_CPOL2_POSITION                              0x5
#define _CM2CON_CPOL2_SIZE                                  0x1
#define _CM2CON_CPOL2_LENGTH                                0x1
#define _CM2CON_CPOL2_MASK                                  0x20
#define _CM2CON_CREF2_POSN                                  0x2
#define _CM2CON_CREF2_POSITION                              0x2
#define _CM2CON_CREF2_SIZE                                  0x1
#define _CM2CON_CREF2_LENGTH                                0x1
#define _CM2CON_CREF2_MASK                                  0x4
#define _CM2CON_EVPOL02_POSN                                0x3
#define _CM2CON_EVPOL02_POSITION                            0x3
#define _CM2CON_EVPOL02_SIZE                                0x1
#define _CM2CON_EVPOL02_LENGTH                              0x1
#define _CM2CON_EVPOL02_MASK                                0x8
#define _CM2CON_EVPOL12_POSN                                0x4
#define _CM2CON_EVPOL12_POSITION                            0x4
#define _CM2CON_EVPOL12_SIZE                                0x1
#define _CM2CON_EVPOL12_LENGTH                              0x1
#define _CM2CON_EVPOL12_MASK                                0x10

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0xF79);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 0F79h");
#endif
// aliases
extern volatile unsigned char           CM1CON              __at(0xF79);
#ifndef _LIB_BUILD
asm("CM1CON equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1CH                   :2;
        unsigned C1R                    :1;
        unsigned C1SP                   :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
    struct {
        unsigned C1CH0                  :1;
        unsigned C1CH1                  :1;
    };
    struct {
        unsigned CCH0                   :1;
    };
    struct {
        unsigned CCH01                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH11                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE1                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON1                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF1                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL0                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL01                :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL1                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL11                :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0xF79);
// bitfield macros
#define _CM1CON0_C1CH_POSN                                  0x0
#define _CM1CON0_C1CH_POSITION                              0x0
#define _CM1CON0_C1CH_SIZE                                  0x2
#define _CM1CON0_C1CH_LENGTH                                0x2
#define _CM1CON0_C1CH_MASK                                  0x3
#define _CM1CON0_C1R_POSN                                   0x2
#define _CM1CON0_C1R_POSITION                               0x2
#define _CM1CON0_C1R_SIZE                                   0x1
#define _CM1CON0_C1R_LENGTH                                 0x1
#define _CM1CON0_C1R_MASK                                   0x4
#define _CM1CON0_C1SP_POSN                                  0x3
#define _CM1CON0_C1SP_POSITION                              0x3
#define _CM1CON0_C1SP_SIZE                                  0x1
#define _CM1CON0_C1SP_LENGTH                                0x1
#define _CM1CON0_C1SP_MASK                                  0x8
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OE_POSN                                  0x5
#define _CM1CON0_C1OE_POSITION                              0x5
#define _CM1CON0_C1OE_SIZE                                  0x1
#define _CM1CON0_C1OE_LENGTH                                0x1
#define _CM1CON0_C1OE_MASK                                  0x20
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1ON_POSN                                  0x7
#define _CM1CON0_C1ON_POSITION                              0x7
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x80
#define _CM1CON0_C1CH0_POSN                                 0x0
#define _CM1CON0_C1CH0_POSITION                             0x0
#define _CM1CON0_C1CH0_SIZE                                 0x1
#define _CM1CON0_C1CH0_LENGTH                               0x1
#define _CM1CON0_C1CH0_MASK                                 0x1
#define _CM1CON0_C1CH1_POSN                                 0x1
#define _CM1CON0_C1CH1_POSITION                             0x1
#define _CM1CON0_C1CH1_SIZE                                 0x1
#define _CM1CON0_C1CH1_LENGTH                               0x1
#define _CM1CON0_C1CH1_MASK                                 0x2
#define _CM1CON0_CCH0_POSN                                  0x0
#define _CM1CON0_CCH0_POSITION                              0x0
#define _CM1CON0_CCH0_SIZE                                  0x1
#define _CM1CON0_CCH0_LENGTH                                0x1
#define _CM1CON0_CCH0_MASK                                  0x1
#define _CM1CON0_CCH01_POSN                                 0x0
#define _CM1CON0_CCH01_POSITION                             0x0
#define _CM1CON0_CCH01_SIZE                                 0x1
#define _CM1CON0_CCH01_LENGTH                               0x1
#define _CM1CON0_CCH01_MASK                                 0x1
#define _CM1CON0_CCH1_POSN                                  0x1
#define _CM1CON0_CCH1_POSITION                              0x1
#define _CM1CON0_CCH1_SIZE                                  0x1
#define _CM1CON0_CCH1_LENGTH                                0x1
#define _CM1CON0_CCH1_MASK                                  0x2
#define _CM1CON0_CCH11_POSN                                 0x1
#define _CM1CON0_CCH11_POSITION                             0x1
#define _CM1CON0_CCH11_SIZE                                 0x1
#define _CM1CON0_CCH11_LENGTH                               0x1
#define _CM1CON0_CCH11_MASK                                 0x2
#define _CM1CON0_COE_POSN                                   0x6
#define _CM1CON0_COE_POSITION                               0x6
#define _CM1CON0_COE_SIZE                                   0x1
#define _CM1CON0_COE_LENGTH                                 0x1
#define _CM1CON0_COE_MASK                                   0x40
#define _CM1CON0_COE1_POSN                                  0x6
#define _CM1CON0_COE1_POSITION                              0x6
#define _CM1CON0_COE1_SIZE                                  0x1
#define _CM1CON0_COE1_LENGTH                                0x1
#define _CM1CON0_COE1_MASK                                  0x40
#define _CM1CON0_CON_POSN                                   0x7
#define _CM1CON0_CON_POSITION                               0x7
#define _CM1CON0_CON_SIZE                                   0x1
#define _CM1CON0_CON_LENGTH                                 0x1
#define _CM1CON0_CON_MASK                                   0x80
#define _CM1CON0_CON1_POSN                                  0x7
#define _CM1CON0_CON1_POSITION                              0x7
#define _CM1CON0_CON1_SIZE                                  0x1
#define _CM1CON0_CON1_LENGTH                                0x1
#define _CM1CON0_CON1_MASK                                  0x80
#define _CM1CON0_CPOL_POSN                                  0x5
#define _CM1CON0_CPOL_POSITION                              0x5
#define _CM1CON0_CPOL_SIZE                                  0x1
#define _CM1CON0_CPOL_LENGTH                                0x1
#define _CM1CON0_CPOL_MASK                                  0x20
#define _CM1CON0_CPOL1_POSN                                 0x5
#define _CM1CON0_CPOL1_POSITION                             0x5
#define _CM1CON0_CPOL1_SIZE                                 0x1
#define _CM1CON0_CPOL1_LENGTH                               0x1
#define _CM1CON0_CPOL1_MASK                                 0x20
#define _CM1CON0_CREF_POSN                                  0x2
#define _CM1CON0_CREF_POSITION                              0x2
#define _CM1CON0_CREF_SIZE                                  0x1
#define _CM1CON0_CREF_LENGTH                                0x1
#define _CM1CON0_CREF_MASK                                  0x4
#define _CM1CON0_CREF1_POSN                                 0x2
#define _CM1CON0_CREF1_POSITION                             0x2
#define _CM1CON0_CREF1_SIZE                                 0x1
#define _CM1CON0_CREF1_LENGTH                               0x1
#define _CM1CON0_CREF1_MASK                                 0x4
#define _CM1CON0_EVPOL0_POSN                                0x3
#define _CM1CON0_EVPOL0_POSITION                            0x3
#define _CM1CON0_EVPOL0_SIZE                                0x1
#define _CM1CON0_EVPOL0_LENGTH                              0x1
#define _CM1CON0_EVPOL0_MASK                                0x8
#define _CM1CON0_EVPOL01_POSN                               0x3
#define _CM1CON0_EVPOL01_POSITION                           0x3
#define _CM1CON0_EVPOL01_SIZE                               0x1
#define _CM1CON0_EVPOL01_LENGTH                             0x1
#define _CM1CON0_EVPOL01_MASK                               0x8
#define _CM1CON0_EVPOL1_POSN                                0x4
#define _CM1CON0_EVPOL1_POSITION                            0x4
#define _CM1CON0_EVPOL1_SIZE                                0x1
#define _CM1CON0_EVPOL1_LENGTH                              0x1
#define _CM1CON0_EVPOL1_MASK                                0x10
#define _CM1CON0_EVPOL11_POSN                               0x4
#define _CM1CON0_EVPOL11_POSITION                           0x4
#define _CM1CON0_EVPOL11_SIZE                               0x1
#define _CM1CON0_EVPOL11_LENGTH                             0x1
#define _CM1CON0_EVPOL11_MASK                               0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned C1CH                   :2;
        unsigned C1R                    :1;
        unsigned C1SP                   :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
    struct {
        unsigned C1CH0                  :1;
        unsigned C1CH1                  :1;
    };
    struct {
        unsigned CCH0                   :1;
    };
    struct {
        unsigned CCH01                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH11                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE1                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON1                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF1                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL0                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL01                :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL1                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL11                :1;
    };
} CM1CONbits_t;
